app/helpers/logins_helper.rb

	def try_login(username , password)
		if Login.find_by(username: username) == nil
			puts "error"
		elsif Login.find_by(username: username).password != password
---
SELECT  "logins".* FROM "logins" WHERE "logins"."username" = $1 LIMIT $2  [["username", "ab"], ["LIMIT", 1]]

	def new_long_incoming(long_url)
		if Url.find_by(long: long_url) == nil
			 @urls = Url.new({:long => long_url, :short => convert_to_short})
			 @urls.save
			 puts "hey"
			 return Url.find_by(long: long_url).short
		else
			return Url.find_by(long: long_url).short
---
SELECT  "urls".* FROM "urls" WHERE "urls"."long" = $1 LIMIT $2  [["long", "first"], ["LIMIT", 1]]
INSERT INTO "urls" ("long", "short", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long", "aaaaaaabbbbbb"], ["short", "ClbXmkI"], ["created_at", "2019-01-21 09:56:20.080569"], ["updated_at", "2019-01-21 09:56:20.080569"]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long" = $1 LIMIT $2  [["long", "okokok"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."long" = $1 LIMIT $2  [["long", "mithi"], ["LIMIT", 1]]

	def find_long_url(short_url)
		if Url.find_by(short: short_url) == nil
			puts "no such short url"
		else
			return Url.find_by(short: short_url).long
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short" = $1 LIMIT $2  [["short", ""], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short" = $1 LIMIT $2  [["short", "TcofSPa"], ["LIMIT", 1]]