app/controllers/logins_controller.rb

	def create
		if params[:commit] == 'A'
			params[:login][:short_op] = new_long_incoming(params[:login][:long])
			params[:commit] = ''
			@login = Login.find(params[:login][:id])
---
SELECT  "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

	def show
		@u = Url.all
		@login = Login.find(params[:id])
---
SELECT  "urls".* FROM "urls" ORDER BY "urls"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]