app/controllers/logins_controller.rb

	def create
		if params[:commit] == 'A' || params[:commit] == 'B'
			convert
			params[:commit] = ''
			render 'logins/show'
			return
		end
  		@login = Login.new(login_params_log)

  		@login.save
---
INSERT INTO "logins" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "asdadasdasd"], ["password", "adadasdasd"], ["created_at", "2019-01-18 12:08:21.702993"], ["updated_at", "2019-01-18 12:08:21.702993"]]

	def show
		puts params
		@login = Login.find(params[:id])
---
SELECT  "logins".* FROM "logins" WHERE "logins"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]